experiments/results/logs/burst-hybrid-007/wrk2.txt
Running 2m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 5999.030ms, rate sampling interval: 17727ms
  Thread calibration: mean lat.: 5921.853ms, rate sampling interval: 16793ms
  Thread calibration: mean lat.: 6003.904ms, rate sampling interval: 17678ms
  Thread calibration: mean lat.: 5830.238ms, rate sampling interval: 14163ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.13s    12.93s   44.04s    54.10%
    Req/Sec    26.60     31.25    79.00     68.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.71s 
 75.000%   25.26s 
 90.000%   34.11s 
 99.000%   42.30s 
 99.900%   43.68s 
 99.990%   44.04s 
 99.999%   44.07s 
100.000%   44.07s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.654     0.000000            1         1.00
       2.065     0.100000         1161         1.11
      34.431     0.200000         2321         1.25
    4147.199     0.300000         3481         1.43
    9428.991     0.400000         4643         1.67
   13705.215     0.500000         5804         2.00
   16023.551     0.550000         6385         2.22
   18268.159     0.600000         6965         2.50
   20873.215     0.650000         7543         2.86
   23035.903     0.700000         8123         3.33
   25264.127     0.750000         8705         4.00
   26509.311     0.775000         8997         4.44
   27770.879     0.800000         9285         5.00
   28950.527     0.825000         9574         5.71
   30310.399     0.850000         9864         6.67
   32145.407     0.875000        10153         8.00
   33226.751     0.887500        10297         8.89
   34111.487     0.900000        10446        10.00
   35192.831     0.912500        10590        11.43
   36470.783     0.925000        10732        13.33
   37715.967     0.937500        10883        16.00
   38436.863     0.943750        10950        17.78
   38797.311     0.950000        11022        20.00
   39419.903     0.956250        11098        22.86
   39616.511     0.962500        11167        26.67
   40140.799     0.968750        11240        32.00
   40435.711     0.971875        11278        35.56
   40534.015     0.975000        11312        40.00
   41025.535     0.978125        11349        45.71
   41385.983     0.981250        11387        53.33
   41484.287     0.984375        11425        64.00
   41615.359     0.985938        11440        71.11
   42074.111     0.987500        11458        80.00
   42270.719     0.989062        11483        91.43
   42303.487     0.990625        11494       106.67
   42369.023     0.992188        11519       128.00
   42401.791     0.992969        11527       142.22
   42434.559     0.993750        11536       160.00
   42500.095     0.994531        11544       182.86
   42598.399     0.995313        11548       213.33
   42860.543     0.996094        11559       256.00
   42958.847     0.996484        11566       284.44
   42958.847     0.996875        11566       320.00
   43089.919     0.997266        11571       365.71
   43319.295     0.997656        11575       426.67
   43450.367     0.998047        11582       512.00
   43450.367     0.998242        11582       568.89
   43548.671     0.998437        11585       640.00
   43581.439     0.998633        11587       731.43
   43646.975     0.998828        11589       853.33
   43712.511     0.999023        11592      1024.00
   43712.511     0.999121        11592      1137.78
   43745.279     0.999219        11594      1280.00
   43810.815     0.999316        11597      1462.86
   43810.815     0.999414        11597      1706.67
   43810.815     0.999512        11597      2048.00
   43810.815     0.999561        11597      2275.56
   43843.583     0.999609        11598      2560.00
   43909.119     0.999658        11599      2925.71
   43909.119     0.999707        11599      3413.33
   44007.423     0.999756        11600      4096.00
   44007.423     0.999780        11600      4551.11
   44007.423     0.999805        11600      5120.00
   44040.191     0.999829        11601      5851.43
   44040.191     0.999854        11601      6826.67
   44040.191     0.999878        11601      8192.00
   44040.191     0.999890        11601      9102.22
   44040.191     0.999902        11601     10240.00
   44072.959     0.999915        11602     11702.86
   44072.959     1.000000        11602          inf
#[Mean    =    15131.638, StdDeviation   =    12929.445]
#[Max     =    44040.192, Total count    =        11602]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11798 requests in 2.00m, 65.74MB read
  Socket errors: connect 0, read 0, write 0, timeout 3024
  Non-2xx or 3xx responses: 10724
Requests/sec:     98.19
Transfer/sec:    560.23KB